#CH05_01. 머신러닝 소개

'''
인공지능의 한 분야이다. 
1959년 아서사무엘은 기계학습을 “컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야”라고 정의하였다. 
즉 사람이 학습하듯이 컴퓨터에도 데이터들을 줘서 학습하게 함으로써 새로운 지식을 얻어내게 하는 분야이다.

y=3x라는 함수를 예로 든다. 
(x.y)의 집합 중 (1,3), (3,9), (4,12), (6,18)의 데이터가 있다고 하자. 
해당 함수를 컴퓨터가 모르더라도 앞의 데이터들을 컴퓨터에 입력하면 컴퓨터가 학습한 후에 
(8,?), (10,?) 등의 질문을 던지면 그 y에 대한 답을 컴퓨터가 할 수 있도록 만드는 것이 기계학습인 것이다.

즉 y=3x란 함수를 프로그래밍하지 않아도 답을 얻게 된다. 
아래의 예처럼 하나의 함수를 유추하려는 방법을 지도 학습(Supervised Learning), 
x의 데이터가 어떻게 분포되었는지를 파악하는 방법을 비지도 학습(Unsupervised Larning)이라 한다.
'''