# CH02_03. 자료형_숫자형

#문제1
'''
a는 100, b는 10000이다.
a+b를 구하시오.
'''
100+10000
#문제2
'''
a는 100, b는 10000이다.
a*b를 구하시오.
'''
100*10000
#문제3
'''
a는 100, b는 10000이다.
a/b를 구하시오.
'''
100/10000

#자주 사용하는 숫자들을 변수에 저장하여 재사용

#변수 생성하는 법1
a=100
b=10000
print(a)
print(b)

a, b = 200, 30000
print(a)
print(b)

#문제4
a는 300, b는 400
a+b, a-b, a*b, a/b
a, b = 300, 400
print(a+b)
print(a-b)
print(a*b)
print(a/b)

'''
**변수명 작성 시 주의사항**
영문자, 숫자, _ 조합으로 구성되어야 함
변수명의 첫 글자는 숫자로 사용할 수 없음
대문자와 소문자는 구분되어 사용됨
변수명 사이에 띄어쓰기 불가
'''

a=1
A=10
print(a)
print(A)