# CH01_01. 머신러닝

'''
1. 머신러닝 정의
-기계가 일일이 코드로 명시하지 않은 동작을 
데이터로부터 학습하여 실행할 수 있도록 하는 
알고리즘을 개발하는 연구 분야

1) 알고리즘
-문제를 풀기 위한 의사 결정 과정

2) 데이터
-객관적인 기준을 위한 정답과 요인들
-주관적인 기준이 아닌 수치에 근거한 객관적인 기준

3) 학습
-데이터로부터 최적의 값을 찾는 과정


2. 머신러닝 알고리즘의 종류

1) 지도 학습 (Supervised Learning)
-정답이 있는 문제를 풀 경우
-회귀(Regression): 정답이 연속형 변수일 때
-분류(Classification): 정답이 비연속형(범주형) 변수일 때

2) 비지도 학습 (Unsupervised Learning)
-정답이 없는 문제를 풀 경우
-군집분석(Clustering): 주어진 데이터가 어떻게 구성되었는지 알아내려는 분석 방법
-강화학습(Reinforcement Learning): 행동에 따른 보상을 최대화시키는 학습 방법

'''